In [9]:
import pandas as pd

In [10]:
df1 = pd.read_csv("pandas_12_1.csv")

In [11]:
df2 = pd.read_csv("pandas_12_2.csv")

In [12]:
df1

   student_id     name  age
0           1    Mason    8
1           2      Ava    6
2           3   Taylor   15
3           4  Georgia   17

In [13]:
df2

   student_id  name  age
0           5   Leo    7
1           6  Alex    7

In [17]:
pd.concat([df1, df2], ignore_index=True)

   student_id     name  age
0           1    Mason    8
1           2      Ava    6
2           3   Taylor   15
3           4  Georgia   17
4           5      Leo    7
5           6     Alex    7